w4d5/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["email", "mittens"], ["password_digest", "$2a$10$f3GywFk1RruKigyymY6Jeecrrumyt5yeuqS7Ejic8OGrHQ4CAy7Wq"], ["session_token", "7bBXiSqo919SBiwdr1bU5Q"]]
---
    def create
        @user = User.new(user_params)
        if @user.save